Program  : PlusOrMinus
Author   : Antoine Morel


## Print instructions : "Type 2 digits and guess the random number : "
++++++++[>++++>++++++>++++++++>++++++++++>++++++++++++<<<<<-]>
>>>++++.>+++++++++++++++++++++++++.---------.-----------.<<<<.>>>>++++++
+++++++++.+++.--------.<<<<.>>>>-----------.+++++.--.++.+++++++++++.-.<<
<<.>>>+++++++++++++.>-----.<+++.<<<.>>>+++.>+++++++.<--.>--..<<<<.>>>>+.
<+++.---.<<<.>>>>--.<----.>----.<+++.>+.--.<<<<.>>>>+.+++++++.--------.<
--.+++.>+++++.<<<<.>>------.<<.[>]<[[-]<]


## Generate a "random number" out of 2 digits
# Get the two digits and remove the ASCII '0' : {0}0|0|0|0|0|0|0|0|0|0| becomes {a}b|0|0|0|0|0|0|0|0|0|
,.>,.>>++++++++[<++++++>-]<[<-<->>-]<<
#Compute a+b=C and a-b+10=D                   : {a}b|0|0|0|0|0|0|0|0|0| becomes |0|0{C}0|0|0|0|D|0|0|0|
[>>+>>>>>+<<<<<<<-]>[>+>>>>>-<<<<<<-]>
# Prepare to compute modulos 10               : |0|0{C}0|0|0|0|D|0|0|0| becomes |0|0{C}10|0|0|0|D|10|0|0|
>>+++++[-<++>>>>++>++<<<<]<<
# Compute C%10=c and D%10=d                   : |0|0{C}10|0|0|0|D|10|0|0| becomes |0|0{0}0|c|0|0|0|0|d|0|
[>->+<[>]>[<+>-]<<[<]>-]>[-]>>>>[>->+<[>]>[<+>-]<<[<]>-]>[-]>
# Compute 10*c+d=x                            : |0|0{0}0|c|0|0|0|0|d|0| becomes {x}0|0|0|0|0|0|0|0|0|0|
[-<<<<<<<<<+>>>>>>>>>]<<<<<[-<<<<++++++++++>>>>]<<<<


## Run the PlusOrMinus algorithm
# Prepare useful prints                                               : {x}0|0|0|0|0|0|0|0|0|0| becomes {x}0|0|0|0|?|p|n|m|=|0|
>>>>+++++++++++[>++++++>++++>+>++++>++++++<<<<<-]>--->+>->->-----<<.<<<<<<<
# Main loop on the difference e (forced to 1 to enter the loop)       : {x}0|0|0|0|?|p|n|m|=|0| becomes |x|0{1}0|0|?|p|n|m|=|0|
>>+[
    # Reset e                                                         : |x|~{~}0|0|?|p|n|m|=|0| becomes |x|~{0}0|0|?|p|n|m|=|0|
    [-]
    # Get the user guess g
        # Print '?'
        >>>.<<<
        # Get the guess                                               : |x|~{0}0|0|?|p|n|m|=|0| becomes |x|~{g}0|0|?|p|n|m|=|0|
        >,.>,.<<++++++++[>------>------<<-]>[<++++++++++>-]>[<<+>>-]<<
        # Print new line
        >>>>>.<<<<<
    # Copy the random number                                          : |x|~{g}0|0|?|p|n|m|=|0| becomes |x|~|g{x}0|?|p|n|m|=|0|
    <<[>>>>+<<<<-]>>>>[<+<<<+>>>>-]<<<<
    # Reset the sign of the difference                                : |x|~|g{x}0|?|p|n|m|=|0| becomes |x{0}g|x|0|?|p|n|m|=|0|
    >[-]
    # Compute the difference e and its sign s                         : |x{0}g|x|0|?|p|n|m|=|0| becomes |x|s{e}0|0|?|p|n|m|=|0|
    >>[<<+>>-<-[<->>>]>>[<]<]<
    # Loop while e is different to 0
    [
        # Move to the next zeroed cell (depends with the sign s !)    : |x|s{e}0|0|?|p|n|m|=|0| becomes |x{0}e|0|0|?|p|n|m|=|0| or |x|s|e{0}0|?|p|n|m|=|0|
        <[>]
        # Print the tip (plus or minus) 5 cells further and the '\n'  : |x{0}e|0|0|?|p|n|m|=|0| becomes |x|0|e|0|0|?{p}n|m|=|0| or|x|s|e{0}0|?|p|n|m|=|0| becomes |x|s|e|0|0|?|p|n{m}=|0|
        >>>>>.[>]<<<.
        # Go back to the 5th cell that is always zero                 : |x|0|e|0|0|?{p}n|m|=|0| or |x|s|e|0|0|?|p|n{m}=|0| becomes |x|~|e|0{0}?|p|n|m|=|0|
        [<]
    ]
    # Go back to the 5th cell that is always zero                     : |x|~{0}0|0|?|p|n|m|=|0| or |x|~|e|0{0}?|p|n|m|=|0| becomes |x|~|~|0{0}?|p|n|m|=|0|
    >>>[<]
# Main loop on the difference e                                       : |x|~{~}0|0|?|p|n|m|=|0|
<<]
# Print the success '=' and '\n'
>>>>>>>.
